serifpersia/ESP32MidiPlayer/src/ESP32MidiPlayer.cpp
#include "ESP32MidiPlayer.h" // Include the header first
#include <stdio.h>              // For snprintf

// --- Constants ---
const uint32_t MTHD_CHUNK_TYPE = 0x4D546864; // "MThd"
const uint32_t MTRK_CHUNK_TYPE = 0x4D54726B; // "MTrk"
const uint8_t META_EVENT = 0xFF;
const uint8_t META_END_OF_TRACK = 0x2F;
const uint8_t META_TEMPO = 0x51;
const uint8_t META_TIME_SIGNATURE = 0x58;
// Add other meta types if needed
const uint8_t META_TRACK_NAME = 0x03;
const uint8_t SYSEX_START = 0xF0;
const uint8_t SYSEX_END = 0xF7;


// --- Static Variables for One-Time Warnings ---
// These are declared at file scope (outside the class)
static bool _divisionWarningLogged = false;
static bool _tempoWarningLogged = false;

// --- Helper Function to Estimate VLQ byte length ---
// (Not part of the class, just a utility for this file)
static uint8_t _getVlqLength(uint32_t value) {
    if (value < 0x80) return 1;      // Max 0x7F
    if (value < 0x4000) return 2;    // Max 0x3FFF
    if (value < 0x200000) return 3;   // Max 0x1FFFFF
    if (value < 0x10000000) return 4; // Max 0x0FFFFFFF (Standard MIDI Limit)
    // Technically possible to encode larger, but highly unlikely/non-standard
    return 5; // Or handle as error? For logging offset, 4 or 5 is usually fine.
}

ESP32MidiPlayer::ESP32MidiPlayer(FS& filesystem) : _fs(filesystem) {
    // Initialize default state
    _resetPlaybackState();
}

ESP32MidiPlayer::~ESP32MidiPlayer() {
    stop(); // Ensure file is closed if open
}

// --- Configuration ---
void ESP32MidiPlayer::setLogCallback(LogCallback callback) { _logCallback = callback; }
void ESP32MidiPlayer::setLogLevel(MidiLogLevel level) { _currentLogLevel = level; } // Added
void ESP32MidiPlayer::setNoteOnCallback(NoteOnCallback callback) { _noteOnCallback = callback; }
void ESP32MidiPlayer::setNoteOffCallback(NoteOffCallback callback) { _noteOffCallback = callback; }
void ESP32MidiPlayer::setControlChangeCallback(ControlChangeCallback callback) { _controlChangeCallback = callback; }
void ESP32MidiPlayer::setProgramChangeCallback(ProgramChangeCallback callback) { _programChangeCallback = callback; }
void ESP32MidiPlayer::setPitchBendCallback(PitchBendCallback callback) { _pitchBendCallback = callback; }
void ESP32MidiPlayer::setTempoChangeCallback(TempoChangeCallback callback) { _tempoChangeCallback = callback; }
void ESP32MidiPlayer::setTimeSignatureCallback(TimeSignatureCallback callback) { _timeSignatureCallback = callback; }
void ESP32MidiPlayer::setEndOfTrackCallback(EndOfTrackCallback callback) { _endOfTrackCallback = callback; }
void ESP32MidiPlayer::setPlaybackCompleteCallback(PlaybackCompleteCallback callback) { _playbackCompleteCallback = callback; }


// --- File Handling & Playback Control ---

void ESP32MidiPlayer::_resetPlaybackState() {
    _state = PlaybackState::STOPPED;
    _currentTick = 0;
    _microsecondsPerQuarterNote = 500000; // Reset tempo to 120 BPM
    _playbackStartMicros = 0;
    _lastEventMicros = 0;
    _pauseStartMicros = 0;
    _tracks.clear();
    _finishedTracks = 0;
    _format = 0;
    _trackCount = 0;
    _division = 96; // Default TPQN

    // Reset track-specific info
    for (auto& track : _tracks) {
        track.currentOffset = track.startOffset;
        track.nextEventTick = 0;
        track.lastStatusByte = 0;
        track.endOfTrackReached = false;
    }
}

bool ESP32MidiPlayer::load(const char* filename) {
    stop(); // Stop any current playback and close the file

    _filename = filename;
    _midiFile = _fs.open(filename, FILE_READ);
    if (!_midiFile) {
        _log(MidiLogLevel::ERROR, "Failed to open MIDI file '%s'", filename);
        _filename = "";
        return false;
    }
    _log(MidiLogLevel::INFO, "Opened MIDI file: %s (Size: %u)", filename, _midiFile.size());

    if (!_parseFileHeader()) {
        _log(MidiLogLevel::ERROR, "Invalid MIDI file header.");
        stop(); // Close file
        return false;
    }

    if (!_prepareTracks()) {
        _log(MidiLogLevel::ERROR, "Failed to find or parse track chunks.");
        stop(); // Close file
        return false;
    }

    _log(MidiLogLevel::INFO, "MIDI File Loaded: Format %u, Tracks %u, TPQN %u", _format, _trackCount, _division);
    _state = PlaybackState::STOPPED; // Ready to play
    return true;
}

void ESP32MidiPlayer::play() {
    if (!_midiFile) {
        _log(MidiLogLevel::ERROR, "No MIDI file loaded, cannot play.");
        return;
    }

    uint64_t now = micros();

    if (_state == PlaybackState::STOPPED) {
        _log(MidiLogLevel::DEBUG, "Starting playback from beginning.");
        _currentTick = 0;
        _finishedTracks = 0;
        // Reset track positions and next event times
        for (size_t i = 0; i < _tracks.size(); ++i) {
             auto& track = _tracks[i];
             track.currentOffset = track.startOffset;
             track.lastStatusByte = 0;
             track.endOfTrackReached = false;
             // Read the first delta time for this track
             uint32_t initialDeltaOffset = track.currentOffset;
             track.nextEventTick = _readVariableLengthQuantity(track.currentOffset);
             _log(MidiLogLevel::DEBUG, "T%d Initial delta %llu (read at offset %u, next offset %u)", i, track.nextEventTick, initialDeltaOffset, track.currentOffset);
        }
        _playbackStartMicros = now;
        _lastEventMicros = now;
        _state = PlaybackState::PLAYING;
        _log(MidiLogLevel::INFO, "Playback started.");
    } else if (_state == PlaybackState::PAUSED) {
        // Adjust timing based on pause duration
        uint64_t pausedDuration = now - _pauseStartMicros;
        _playbackStartMicros += pausedDuration; // Effectively shift start time forward
        _lastEventMicros += pausedDuration;     // Shift last event time forward too
        _state = PlaybackState::PLAYING;
        _log(MidiLogLevel::INFO, "Playback resumed after %llu us pause.", pausedDuration);
    } else if (_state == PlaybackState::PLAYING) {
        _log(MidiLogLevel::WARN, "Play command received while already playing.");
    }
}

void ESP32MidiPlayer::pause() {
    if (_state == PlaybackState::PLAYING) {
        _state = PlaybackState::PAUSED;
        _pauseStartMicros = micros();
        _log(MidiLogLevel::INFO, "Playback paused at tick %lu.", (uint32_t)_currentTick);
        // Optional: Send All Notes Off / All Sound Off CC messages if desired
        // for (uint8_t ch = 0; ch < 16; ++ch) {
        //     if (_controlChangeCallback) _controlChangeCallback(ch, 123, 0); // All notes off
        //     if (_controlChangeCallback) _controlChangeCallback(ch, 120, 0); // All sound off
        // }
    } else {
         _log(MidiLogLevel::WARN, "Pause command received but not playing.");
    }
}

