serifpersia/ESP32MidiPlayer/src/ESP32MidiPlayer.cpp
void ESP32MidiPlayer::resume() {
    if (_state == PlaybackState::PAUSED) {
        play(); // Same logic for resuming as starting from paused state
    } else {
         _log(MidiLogLevel::WARN, "Resume command received but not paused.");
    }
}

void ESP32MidiPlayer::stop() {
    bool wasPlaying = (_state != PlaybackState::STOPPED);
    if (_midiFile) {
        _midiFile.close();
        if (wasPlaying) _log(MidiLogLevel::INFO, "MIDI file closed due to stop.");
        else _log(MidiLogLevel::DEBUG, "MIDI file closed."); // Might be closed during load error etc.
    }
    _filename = "";
    _resetPlaybackState(); // Resets state to STOPPED among other things

     if (wasPlaying) {
        _log(MidiLogLevel::INFO, "Playback stopped.");
        // Optional: Send All Notes Off / All Sound Off CC messages
        // for (uint8_t ch = 0; ch < 16; ++ch) {
        //     if (_controlChangeCallback) _controlChangeCallback(ch, 123, 0); // All notes off
        //     if (_controlChangeCallback) _controlChangeCallback(ch, 120, 0); // All sound off
        // }
     }
}

// --- Main Loop Update ---

void ESP32MidiPlayer::tick() {
    if (_state != PlaybackState::PLAYING) {
        return; // Only process if playing
    }

    // 1. Advance Tick Time based on micros()
    _advanceTickTime();

    // 2. Process all events scheduled up to the current tick
    while (true) {
        int nextTrackIdx = _findTrackWithNextEvent();

        // If no track has an event ready (or all tracks finished)
        if (nextTrackIdx < 0) {
            _log(MidiLogLevel::VERBOSE, "Tick %llu: No tracks ready.", _currentTick); // Usually too noisy
            break; // No tracks have events scheduled
        }

        // Check if the *earliest* event is actually due yet
        if (_tracks[nextTrackIdx].nextEventTick > _currentTick) {
            // _log(MidiLogLevel::VERBOSE, "Tick %llu: Earliest event on T%d is at tick %llu, not due yet.", _currentTick, nextTrackIdx, _tracks[nextTrackIdx].nextEventTick);
            break; // No more events ready at this exact moment
        }

        // Process the event from the chosen track
        // _log(MidiLogLevel::DEBUG, "Tick %llu: Processing event for T%d scheduled at tick %llu", _currentTick, nextTrackIdx, _tracks[nextTrackIdx].nextEventTick);
        _processNextEvent(); // This function finds the track internally again

         // Check if all tracks are finished AFTER processing an event
        if (_finishedTracks >= _trackCount) {
             _log(MidiLogLevel::INFO, "All tracks finished.");
             if (_playbackCompleteCallback) {
                 _playbackCompleteCallback();
             }
             stop(); // Stop playback automatically
             break; // Exit the while loop
        }
    }
}

// --- Status Queries ---
PlaybackState ESP32MidiPlayer::getState() const { return _state; }
bool ESP32MidiPlayer::isPlaying() const { return _state == PlaybackState::PLAYING; }
bool ESP32MidiPlayer::isPaused() const { return _state == PlaybackState::PAUSED; }
uint32_t ESP32MidiPlayer::getCurrentTick() const { return (uint32_t)_currentTick; } // Cast for typical usage
uint32_t ESP32MidiPlayer::getTempo() const { return _microsecondsPerQuarterNote; }

// --- Private Helper Methods Implementation ---

// Reads Big-Endian uint16 from file at current position + offset, advances position
uint16_t ESP32MidiPlayer::_readUint16BE(uint32_t& offset) {
    uint8_t buffer[2];
    if (_readBytes(offset, buffer, 2) == 2) {
        offset += 2;
        return ((uint16_t)buffer[0] << 8) | buffer[1];
    }
    _log(MidiLogLevel::ERROR, "Read error: Uint16BE at offset %u", offset);
    stop(); // Critical error, stop playback
    return 0;
}

// Reads Big-Endian uint32 from file at current position + offset, advances position
uint32_t ESP32MidiPlayer::_readUint32BE(uint32_t& offset) {
    uint8_t buffer[4];
    if (_readBytes(offset, buffer, 4) == 4) {
        offset += 4;
        return ((uint32_t)buffer[0] << 24) | ((uint32_t)buffer[1] << 16) | ((uint32_t)buffer[2] << 8) | buffer[3];
    }
     _log(MidiLogLevel::ERROR, "Read error: Uint32BE at offset %u", offset);
     stop(); // Critical error
    return 0;
}

// Reads a single byte
uint8_t ESP32MidiPlayer::_readUint8(uint32_t& offset) {
    uint8_t buffer[1];
    if (_readBytes(offset, buffer, 1) == 1) {
        offset += 1;
        return buffer[0];
    }
    _log(MidiLogLevel::ERROR, "Read error: Uint8 at offset %u", offset);
    stop(); // Critical error
    return 0;
}


// Reads bytes directly from file - basic implementation
uint32_t ESP32MidiPlayer::_readBytes(uint32_t offset, uint8_t* buffer, uint32_t length) {
    if (!_midiFile) {
        _log(MidiLogLevel::ERROR, "Read attempt failed: File not open (offset %u)", offset);
        return 0;
    }
    if (!_midiFile.seek(offset)) {
        _log(MidiLogLevel::ERROR, "Seek failed to offset %u", offset);
        // Consider stopping playback on seek fail? Maybe file closed unexpectedly.
        stop();
        return 0;
    }
    size_t bytesRead = _midiFile.read(buffer, length);
    if (bytesRead != length) {
        // This might happen legitimately if near EOF for some reads (like VLQ),
        // but can be an error for others (like fixed-size reads). The calling function should check.
         _log(MidiLogLevel::WARN, "Read incomplete at offset %u. Requested %u, got %u. EOF?", offset, length, bytesRead);
         // Should we stop? Depends if the caller expected exactly 'length' bytes.
         // For now, just return what was read. The caller must handle potential errors.
    }
    return bytesRead;
}
// Peeks bytes directly from file (reads without changing file position)
uint32_t ESP32MidiPlayer::_peekBytes(uint32_t offset, uint8_t* buffer, uint32_t length) {
     if (!_midiFile) {
        _log(MidiLogLevel::ERROR, "Peek attempt failed: File not open (offset %u)", offset);
        return 0;
    }
    size_t currentPos = _midiFile.position(); // Get current position
    if (!_midiFile.seek(offset)) {
         _log(MidiLogLevel::ERROR, "Peek seek failed to offset %u", offset);
        // Don't try to restore position if seek failed
        return 0;
    }
    size_t bytesRead = _midiFile.read(buffer, length);
    if (!_midiFile.seek(currentPos)) { // Attempt to restore position
         _log(MidiLogLevel::ERROR, "Peek failed to restore file position to %u after reading at %u", currentPos, offset);
         stop(); // If we can't restore position, state is likely corrupted
    }
     if (bytesRead != length) {
        _log(MidiLogLevel::WARN, "Peek incomplete at offset %u. Requested %u, got %u. EOF?", offset, length, bytesRead);
        // Return actual bytes read
    }
    return bytesRead;
}


