serifpersia/ESP32MidiPlayer/src/ESP32MidiPlayer.cpp
// Reads a MIDI variable-length quantity from the file
uint32_t ESP32MidiPlayer::_readVariableLengthQuantity(uint32_t& offset) {
    uint32_t value = 0;
    uint8_t byte_in;
    uint32_t bytesReadCount = 0;
    uint32_t startOffset = offset; // For error logging

    do {
        if (_readBytes(offset, &byte_in, 1) != 1) {
             _log(MidiLogLevel::ERROR, "VLQ read error at file offset %u (started at %u)", offset, startOffset);
             stop(); // Can't recover if VLQ is cut short
             return 0; // Error reading byte
        }
        offset++;
        bytesReadCount++;
        value = (value << 7) | (byte_in & 0x7F);
        if (bytesReadCount > 4) {
            // Standard MIDI VLQs shouldn't exceed 4 bytes (representing up to 0x0FFFFFFF)
            _log(MidiLogLevel::ERROR, "VLQ too long (>4 bytes) at file offset %u (started at %u)", offset, startOffset);
            stop(); // Corrupt data
            return value; // Return potentially garbage value, but playback stopped
        }
    } while (byte_in & 0x80); // Continue if MSB is set

    return value;
}


bool ESP32MidiPlayer::_parseFileHeader() {
    uint32_t currentOffset = 0;
    // Read MThd chunk header
    uint32_t chunkType = _readUint32BE(currentOffset); // Offset advanced inside
    if (!_midiFile) return false; // Check if readUint32BE stopped playback
    uint32_t headerLength = _readUint32BE(currentOffset); // Offset advanced inside
    if (!_midiFile) return false;

    if (chunkType != MTHD_CHUNK_TYPE) {
        _log(MidiLogLevel::ERROR, "Invalid MThd chunk type (Expected 0x%08X, Got 0x%08X)", MTHD_CHUNK_TYPE, chunkType);
        return false;
    }
     if (headerLength < 6) {
        _log(MidiLogLevel::ERROR, "Invalid MThd header length (%u, expected >= 6)", headerLength);
        return false;
    }

    _format = _readUint16BE(currentOffset); // Offset advanced inside
     if (!_midiFile) return false;
    _trackCount = _readUint16BE(currentOffset); // Offset advanced inside
     if (!_midiFile) return false;
    _division = _readUint16BE(currentOffset); // Offset advanced inside
     if (!_midiFile) return false;


    // We only reliably support TPQN timing for now
    if (_division & 0x8000) {
        // SMPTE timing format (frames per second)
        int8_t framesPerSecond = -((int8_t)(_division >> 8)); // Negative frames per second code
        uint8_t ticksPerFrame = _division & 0xFF;
        _log(MidiLogLevel::WARN, "SMPTE timing format (FPS: %d, Ticks/Frame: %u) detected. Playback timing may be incorrect!", framesPerSecond, ticksPerFrame);
        // For simplicity, we'll *try* to continue using a default TPQN, but timing will be wrong.
        // A more robust library would handle SMPTE timing calculations.
        _division = 96; // Fallback TPQN
         _log(MidiLogLevel::WARN, "Falling back to TPQN = %u for timing calculations.", _division);
    } else {
         _log(MidiLogLevel::DEBUG, "TPQN (Ticks Per Quarter Note) division found: %u", _division);
    }

    // Skip any extra header data beyond the standard 6 bytes
    uint32_t extraData = headerLength - 6;
    if (extraData > 0) {
         _log(MidiLogLevel::DEBUG, "Skipping %u extra bytes in MThd header.", extraData);
         currentOffset += extraData;
         if (!_midiFile.seek(currentOffset)) {
             _log(MidiLogLevel::ERROR,"Failed to seek past extra MThd header data.");
             return false;
         }
    }

    return true;
}

bool ESP32MidiPlayer::_prepareTracks() {
    if (_trackCount == 0) {
        _log(MidiLogLevel::ERROR, "MIDI file header indicates 0 tracks.");
        return false;
    }
    _tracks.resize(_trackCount); // Allocate space for track info
    uint32_t currentOffset = 6 + 8; // Start searching after MThd ID(4)+Length(4)+Data(6)

    for (uint16_t i = 0; i < _trackCount; ++i) {
        bool trackFound = false;
        // Protect against infinite loop if file is corrupt
        uint32_t searchStartOffset = currentOffset;
        uint32_t fileSize = _midiFile.size();

        while (currentOffset < fileSize) {
             // Need at least 8 bytes for ID + Length
            if (currentOffset + 8 > fileSize) {
                 _log(MidiLogLevel::ERROR, "Reached EOF while searching for MTrk header for track %u (offset %u)", i, currentOffset);
                 return false;
            }

            uint32_t chunkType = _readUint32BE(currentOffset);
            if (!_midiFile) return false; // Read error check
            uint32_t chunkLength = _readUint32BE(currentOffset);
             if (!_midiFile) return false; // Read error check


            if (chunkType == MTRK_CHUNK_TYPE) {
                 _log(MidiLogLevel::INFO, "Found Track %u header at offset %u, data length %u", i, currentOffset - 8, chunkLength);
                _tracks[i].startOffset = currentOffset; // Start of track *data*
                _tracks[i].currentOffset = currentOffset; // Initially same
                _tracks[i].nextEventTick = 0; // Will be read on play()
                _tracks[i].endOfTrackReached = false;
                _tracks[i].lastStatusByte = 0;

                // Skip over this track's data to find the next one
                currentOffset += chunkLength;
                 // Basic sanity check for chunk length
                 if (currentOffset > fileSize) {
                      _log(MidiLogLevel::ERROR, "Track %u chunk length (%u) exceeds file size (%u) from offset %u", i, chunkLength, fileSize, _tracks[i].startOffset);
                      return false;
                 }
                trackFound = true;
                break; // Found track i, move to next outer loop iteration
            } else {
                // Handle potential non-MTrk chunks between MThd and MTrk, or between MTrk chunks
                char chunkTypeStr[5];
                chunkTypeStr[0] = (chunkType >> 24) & 0xFF;
                chunkTypeStr[1] = (chunkType >> 16) & 0xFF;
                chunkTypeStr[2] = (chunkType >> 8) & 0xFF;
                chunkTypeStr[3] = chunkType & 0xFF;
                chunkTypeStr[4] = '\0';
                 _log(MidiLogLevel::WARN, "Skipping unexpected chunk type '%s' (0x%08X) at offset %u, length %u", chunkTypeStr, chunkType, currentOffset - 8, chunkLength);
                 currentOffset += chunkLength; // Skip over this unknown chunk
                 // Sanity check
                  if (currentOffset > fileSize) {
                      _log(MidiLogLevel::ERROR, "Unexpected chunk '%s' length (%u) exceeds file size (%u) from offset %u", chunkTypeStr, chunkLength, fileSize, currentOffset - chunkLength - 8);
                      return false;
                 }
            }

