serifpersia/ESP32MidiPlayer/src/ESP32MidiPlayer.cpp
            // Prevent infinite loop on corrupt files where offset doesn't advance
            if(currentOffset <= searchStartOffset && chunkLength == 0 && chunkType != MTRK_CHUNK_TYPE){
                _log(MidiLogLevel::ERROR, "Detected potential infinite loop parsing chunks near offset %u. Aborting.", currentOffset);
                return false;
            }
            searchStartOffset = currentOffset; // Update for next iteration check
        }
        if (!trackFound) {
             _log(MidiLogLevel::ERROR, "Could not find MTrk chunk for track %u after offset %u", i, searchStartOffset);
             return false;
        }
    }
    return true;
}

// Calculate elapsed ticks based on micros()
void ESP32MidiPlayer::_advanceTickTime() {
    uint64_t now = micros();

    // Handle potential micros() rollover (every ~71 minutes)
    // A simple check: if 'now' is less than 'last', assume rollover.
    // Note: This isn't perfectly robust if loop iterations are very long,
    // but usually sufficient for Arduino.
    uint64_t deltaMicros;
    if (now >= _lastEventMicros) {
        deltaMicros = now - _lastEventMicros;
    } else {
        // Rollover occurred
        deltaMicros = (UINT64_MAX - _lastEventMicros) + 1 + now;
        _log(MidiLogLevel::DEBUG, "micros() rollover detected.");
    }


    // Calculate microseconds per tick
    // Avoid division by zero if division is somehow invalid
    if (_division == 0) {
         if (!_divisionWarningLogged){ // Log only once
            _log(MidiLogLevel::ERROR, "MIDI division (TPQN) is zero! Cannot calculate timing. Defaulting to 96.");
            _divisionWarningLogged = true;
         }
        _division = 96;
    }
    // Use double for precision in calculation, especially for high TPQN or slow tempos
    double microsPerTick = (double)_microsecondsPerQuarterNote / _division;

    if (microsPerTick > 0) {
        // Calculate how many ticks should have passed
        uint64_t ticksElapsed = (uint64_t)(deltaMicros / microsPerTick);

        if (ticksElapsed > 0) {
            _currentTick += ticksElapsed;
            // Adjust _lastEventMicros precisely, avoiding drift accumulation
            // Use the calculated microsPerTick for the adjustment
            _lastEventMicros += (uint64_t)(ticksElapsed * microsPerTick);

            // Minor adjustment: If rollover occurred, _lastEventMicros might now be
            // slightly off due to calculation order. Re-syncing is complex.
            // The current approach minimizes drift but might have tiny jumps near rollover.
             // _log(MidiLogLevel::VERBOSE, "Advanced %llu ticks based on %llu us. New tick: %llu", ticksElapsed, deltaMicros, _currentTick);
        }
    }
     // Optional: Log if microsPerTick is zero (should only happen if tempo is 0, which is invalid MIDI)
     else if (_microsecondsPerQuarterNote == 0) {
         if (!_tempoWarningLogged) { // Log only once
            _log(MidiLogLevel::WARN, "Tempo is zero (usPerQN = 0), timing stalled.");
            _tempoWarningLogged = true;
         }
     }
}

// Find the track with the smallest nextEventTick that hasn't ended
int ESP32MidiPlayer::_findTrackWithNextEvent() const {
    int nextTrack = -1;
    uint64_t earliestTick = UINT64_MAX;

    for (int i = 0; i < _tracks.size(); ++i) {
        if (!_tracks[i].endOfTrackReached) {
             // If multiple tracks have the same earliest tick, prefer lower track index (standard practice)
            if (_tracks[i].nextEventTick < earliestTick) {
                earliestTick = _tracks[i].nextEventTick;
                nextTrack = i;
            }
        }
    }
    return nextTrack;
}


// Process the next due MIDI event from the correct track
void ESP32MidiPlayer::_processNextEvent() {
    int trackIdx = _findTrackWithNextEvent();
    if (trackIdx < 0) {
         _log(MidiLogLevel::DEBUG, "processNextEvent called but no track found with pending events.");
         return; // Should not happen if called correctly after check in tick()
    }

    TrackInfo& track = _tracks[trackIdx];

    // This event's tick timestamp (was calculated previously)
    uint64_t eventTick = track.nextEventTick;

    // Log the offset *before* reading anything for this event
    uint32_t eventStartOffset = track.currentOffset;

    // Read the first byte (status or data1)
    uint8_t firstByte = _readUint8(track.currentOffset);
    if (!_midiFile) return; // ReadUint8 might stop playback on error

     _log(MidiLogLevel::DEBUG, "T%d @ Tick %llu (Offset %u): Read first byte: 0x%02X",
         trackIdx, eventTick, eventStartOffset, firstByte);


    uint8_t statusByte;
    uint8_t data1_from_running = 0; // Store data1 if read here
    bool runningStatus = false;

    // Handle MIDI Running Status
    if (firstByte < 0x80) { // Data byte instead of status byte
        if (track.lastStatusByte == 0 || track.lastStatusByte < 0x80 || track.lastStatusByte >= 0xF0) {
             _log(MidiLogLevel::ERROR, "T%d @ Tick %llu (Offset %u): Running status error: Invalid or missing previous status byte (0x%02X).",
                  trackIdx, eventTick, eventStartOffset, track.lastStatusByte);
              track.endOfTrackReached = true; // Mark as finished to avoid corrupt data loops
              _finishedTracks++;
              return;
        }
        statusByte = track.lastStatusByte; // Reuse the last status byte
        data1_from_running = firstByte;    // This byte is actually the first data byte
        runningStatus = true;
         _log(MidiLogLevel::DEBUG, "T%d @ Tick %llu: Applying Running Status. Reusing Status 0x%02X, Data1 = 0x%02X (%u)",
              trackIdx, eventTick, statusByte, data1_from_running, data1_from_running);
    } else {
        // It's a new status byte
        statusByte = firstByte;
        // update running status *only* if it's a Channel Voice/Mode message (0x8n to 0xEn)
        if (statusByte >= 0x80 && statusByte <= 0xEF) {
            if(track.lastStatusByte != statusByte) {
                 _log(MidiLogLevel::DEBUG, "T%d @ Tick %llu: New Status Byte 0x%02X (Updating lastStatusByte)",
                      trackIdx, eventTick, statusByte);
                 track.lastStatusByte = statusByte;
            } else {
                 // Repeated status byte. Technically NOT running status, but good to know.
                 _log(MidiLogLevel::DEBUG, "T%d @ Tick %llu: Repeated Status Byte 0x%02X (lastStatusByte unchanged)",
                      trackIdx, eventTick, statusByte);
            }
        } else {
            // Meta (0xFF) or System Common/Realtime (0xF0-0xF7) don't affect channel running status
             _log(MidiLogLevel::DEBUG, "T%d @ Tick %llu: Meta/SysEx/System Status Byte 0x%02X (lastStatusByte unchanged)",
                  trackIdx, eventTick, statusByte);
            // Standard MIDI Spec: System messages (F0-F7) cancel running status. FF (Meta) does NOT.
            // Let's implement cancellation for F0-F7 for correctness, although it's rare to see running status after these.
            if (statusByte >= 0xF0 && statusByte <= 0xF7) {
                 _log(MidiLogLevel::DEBUG, "T%d @ Tick %llu: System Message 0x%02X -> Cancelling Running Status.", trackIdx, eventTick, statusByte);
                 track.lastStatusByte = 0; // Cancel running status
            }
        }
        runningStatus = false;
    }

    // Process based on status byte type
    if (statusByte == META_EVENT) { // 0xFF
        _log(MidiLogLevel::DEBUG, "T%d @ Tick %llu: Handling Meta Event (0xFF)", trackIdx, eventTick);
        _handleMetaEvent(trackIdx, track.currentOffset);
    } else if (statusByte == SYSEX_START || statusByte == SYSEX_END) { // 0xF0, 0xF7
         _log(MidiLogLevel::DEBUG, "T%d @ Tick %llu: Handling SysEx Event (0x%02X)", trackIdx, eventTick, statusByte);
         _handleSysexEvent(trackIdx, statusByte, track.currentOffset);
    } else if (statusByte >= 0x80 && statusByte <= 0xEF) { // Channel Voice/Mode Messages (8n, 9n, An, Bn, Cn, Dn, En)
        _log(MidiLogLevel::DEBUG, "T%d @ Tick %llu: Handling MIDI Event (0x%02X), Running Status = %s",
             trackIdx, eventTick, statusByte, runningStatus ? "true" : "false");
        _handleMidiEvent(trackIdx, statusByte, track.currentOffset, runningStatus, data1_from_running);
    } else if (statusByte >= 0xF1 && statusByte <= 0xFE) { // Other System Common / Realtime (excl F0, F7, FF)
         _log(MidiLogLevel::WARN, "T%d @ Tick %llu (Offset %u): Ignoring System message 0x%02X (not handled).",
              trackIdx, eventTick, eventStartOffset, statusByte );
         // These messages typically don't have data bytes or lengths defined in the MTrk chunk in the same way.
         // Standard practice is often to ignore them in simple file players. If needed, add specific handlers.
         // We already read the status byte, so just proceed to read the next delta time.
         track.lastStatusByte = 0; // Cancel running status as per spec.
    } else {
         // This case should ideally not be reached if all ranges are covered.
         _log(MidiLogLevel::WARN, "T%d @ Tick %llu (Offset %u): Ignoring unknown/unhandled status byte 0x%02X",
              trackIdx, eventTick, eventStartOffset, statusByte );
    }


