serifpersia/ESP32MidiPlayer/src/ESP32MidiPlayer.cpp
    // If the track hasn't ended BY THE HANDLER ABOVE, read the delta-time for its *next* event
    if (!track.endOfTrackReached) {
        uint32_t nextDeltaOffset = track.currentOffset; // Log offset before reading delta
        uint32_t nextDelta = _readVariableLengthQuantity(track.currentOffset);
        if (!_midiFile) return; // Check if VLQ read failed

        uint64_t nextTick = eventTick + nextDelta; // Schedule relative to the current event's tick
        _log(MidiLogLevel::DEBUG, "T%d @ Tick %llu (Read delta at offset %u): Read next delta %u -> Next event scheduled for Tick %llu (Offset after delta: %u)",
             trackIdx, eventTick, nextDeltaOffset, nextDelta, nextTick, track.currentOffset);
        track.nextEventTick = nextTick; // Schedule the *next* event
    } else {
         _log(MidiLogLevel::DEBUG, "T%d @ Tick %llu: Track ended, not reading next delta.", trackIdx, eventTick);
    }
}

// --- Event Handlers ---

// Handles Channel Voice messages (0x80-0xEF)
void ESP32MidiPlayer::_handleMidiEvent(uint8_t trackIndex, uint8_t statusByte, uint32_t& trackOffset, bool runningStatusUsed, uint8_t data1_val) {
    uint8_t command = statusByte & 0xF0;
    uint8_t channel = statusByte & 0x0F;
    uint8_t data1 = data1_val; // Use value passed if running status was used
    uint8_t data2 = 0;
    uint32_t offsetBeforeDataRead = trackOffset; // For logging

    _log(MidiLogLevel::DEBUG, "_handleMidiEvent T%d: Status=0x%02X, Ch=%u, Cmd=0x%02X, Running=%s, Offset=%u",
         trackIndex, statusByte, channel, command, runningStatusUsed ? "true" : "false", trackOffset);


    // Determine how many data bytes to read based on the command
    // and whether running status already provided data1
    switch (command) {
        case 0x80: // Note Off (2 bytes total)
        case 0x90: // Note On (2 bytes total)
        case 0xA0: // Polyphonic Key Pressure (Aftertouch) (2 bytes total)
        case 0xB0: // Control Change (2 bytes total)
        case 0xE0: // Pitch Bend Change (2 bytes total)
            if (!runningStatusUsed) {
                data1 = _readUint8(trackOffset);
                if (!_midiFile) return; // Check read status
                 _log(MidiLogLevel::DEBUG, "_handleMidiEvent T%d: Read Data1 = 0x%02X (%u)", trackIndex, data1, data1);
            } else {
                 // data1 was already set from data1_val passed in
                 _log(MidiLogLevel::DEBUG, "_handleMidiEvent T%d: Using Data1 = 0x%02X (%u) from running status", trackIndex, data1, data1);
            }
            // Always read data2 for these 2-byte messages
            data2 = _readUint8(trackOffset);
            if (!_midiFile) return; // Check read status
            _log(MidiLogLevel::DEBUG, "_handleMidiEvent T%d: Read Data2 = 0x%02X (%u)", trackIndex, data2, data2);
            break;

        case 0xC0: // Program Change (1 byte total)
        case 0xD0: // Channel Pressure (Aftertouch) (1 byte total)
            if (!runningStatusUsed) {
                data1 = _readUint8(trackOffset); // Read data1 if not already read via running status
                if (!_midiFile) return; // Check read status
                _log(MidiLogLevel::DEBUG, "_handleMidiEvent T%d: Read Data1 = 0x%02X (%u)", trackIndex, data1, data1);
            } else {
                 // data1 was already set from data1_val passed in
                 _log(MidiLogLevel::DEBUG, "_handleMidiEvent T%d: Using Data1 = 0x%02X (%u) from running status", trackIndex, data1, data1);
            }
            // data2 is not used for these commands (remains 0)
            break;
        default:
            // This should theoretically not be reached if _processNextEvent filters correctly
            _log(MidiLogLevel::WARN, "_handleMidiEvent T%d: Unexpected MIDI command 0x%02X in status 0x%02X", trackIndex, command, statusByte);
            return; // Don't try to process further or call callbacks
    }

     _log(MidiLogLevel::DEBUG, "_handleMidiEvent T%d: Final Data Bytes: Data1=0x%02X (%u), Data2=0x%02X (%u). Offset after read: %u",
          trackIndex, data1, data1, data2, data2, trackOffset);


    // --- Call appropriate callback (if registered) ---
    switch (command) {
        case 0x80: // Note Off
             _log(MidiLogLevel::DEBUG, "CALL T%d: NoteOff Ch=%u Note=%u Vel=%u", trackIndex, channel + 1, data1, data2);
            if (_noteOffCallback) _noteOffCallback(channel, data1, data2);
            break;
        case 0x90: // Note On
            if (data2 == 0) { // Velocity 0 is Note Off
                 _log(MidiLogLevel::DEBUG, "CALL T%d: NoteOff (Vel 0) Ch=%u Note=%u Vel=%u", trackIndex, channel + 1, data1, data2);
                if (_noteOffCallback) _noteOffCallback(channel, data1, 0);
            } else {
                 _log(MidiLogLevel::DEBUG, "CALL T%d: NoteOn Ch=%u Note=%u Vel=%u", trackIndex, channel + 1, data1, data2);
                if (_noteOnCallback) _noteOnCallback(channel, data1, data2);
            }
            break;
        case 0xA0: // Polyphonic Key Pressure
             _log(MidiLogLevel::DEBUG, "CALL T%d: PolyPressure Ch=%u Note=%u Pressure=%u", trackIndex, channel + 1, data1, data2);
            // if (_polyPressureCallback) _polyPressureCallback(channel, data1, data2); // Example if you add this
            break;
        case 0xB0: // Control Change
             _log(MidiLogLevel::DEBUG, "CALL T%d: ControlChange Ch=%u CC=%u Val=%u", trackIndex, channel + 1, data1, data2);
            if (_controlChangeCallback) _controlChangeCallback(channel, data1, data2);
            break;
        case 0xC0: // Program Change
             _log(MidiLogLevel::DEBUG, "CALL T%d: ProgramChange Ch=%u Prog=%u", trackIndex, channel + 1, data1);
            if (_programChangeCallback) _programChangeCallback(channel, data1);
            break;
        case 0xD0: // Channel Pressure
            _log(MidiLogLevel::DEBUG, "CALL T%d: ChannelPressure Ch=%u Pressure=%u", trackIndex, channel + 1, data1);
            // if (_channelPressureCallback) _channelPressureCallback(channel, data1); // Example
            break;
        case 0xE0: // Pitch Bend
            {
                // Combine LSB (data1) and MSB (data2) - Both are 7-bit
                int16_t bendValue = (((int16_t)data2 & 0x7F) << 7) | (data1 & 0x7F);
                // MIDI pitch bend is 0 to 16383, centered at 8192. Convert to -8192 to +8191
                bendValue -= 8192;
                 _log(MidiLogLevel::DEBUG, "CALL T%d: PitchBend Ch=%u Val=%d (Raw LSB=0x%02X MSB=0x%02X Combined=%u)", trackIndex, channel + 1, bendValue, data1, data2, bendValue+8192);
                if (_pitchBendCallback) _pitchBendCallback(channel, bendValue);
            }
            break;
    }
}


