serifpersia/ESP32MidiPlayer/src/ESP32MidiPlayer.cpp
void ESP32MidiPlayer::_handleMetaEvent(uint8_t trackIndex, uint32_t& trackOffset) {
    uint8_t metaType = _readUint8(trackOffset);
     if (!_midiFile) return;
    uint32_t length = _readVariableLengthQuantity(trackOffset);
     if (!_midiFile) return;

     _log(MidiLogLevel::DEBUG, "T%d Meta Event: Type 0x%02X, Len %u at offset %u", trackIndex, metaType, length, trackOffset - 1 - _getVlqLength(length)); // Adjust offset for log

    uint32_t dataOffset = trackOffset; // Remember where data starts

    switch (metaType) {
        case META_END_OF_TRACK: // 0x2F
            if (!_tracks[trackIndex].endOfTrackReached) {
                _tracks[trackIndex].endOfTrackReached = true;
                _finishedTracks++;
                 _log(MidiLogLevel::INFO, "Track %u reached EndOfTrack (Total finished: %u/%u)", trackIndex, _finishedTracks, _trackCount);
                if (_endOfTrackCallback) {
                    _endOfTrackCallback(trackIndex);
                }
            } else {
                 _log(MidiLogLevel::WARN, "Track %u encountered multiple EndOfTrack events.", trackIndex);
            }
             // EOT should have length 0, but we still need to "consume" the length bytes read by VLQ earlier.
             // No actual data bytes to read here. The offset is already correct.
             // However, MIDI files *can* technically have non-zero length EOTs. Skip data if present.
             if (length > 0) {
                 _log(MidiLogLevel::WARN, "Track %u EndOfTrack meta event has non-zero length %u. Skipping data.", trackIndex, length);
                 trackOffset += length; // Skip declared length
             }
            break;

        case META_TEMPO: // 0x51 Tempo Setting (Microseconds per Quarter Note)
            if (length == 3) {
                uint8_t buffer[3];
                if (_readBytes(trackOffset, buffer, 3) == 3) {
                     uint32_t newTempo = ((uint32_t)buffer[0] << 16) | ((uint32_t)buffer[1] << 8) | buffer[2];
                     trackOffset += 3;
                     // Basic sanity check for tempo
                     if (newTempo == 0) {
                         _log(MidiLogLevel::WARN, "Track %u requested Tempo of 0 us/qn (invalid). Ignoring change.", trackIndex);
                     } else {
                         _microsecondsPerQuarterNote = newTempo;
                          double bpm = 60000000.0 / _microsecondsPerQuarterNote;
                         _log(MidiLogLevel::DEBUG, "Tempo changed to %u us/qn (%.2f BPM)", _microsecondsPerQuarterNote, bpm);
                         if (_tempoChangeCallback) {
                             _tempoChangeCallback(_microsecondsPerQuarterNote);
                         }
                         _tempoWarningLogged = false; // Reset warning flag if tempo becomes valid again
                     }
                } else {
                     _log(MidiLogLevel::ERROR, "Error reading Tempo data for track %u", trackIndex);
                     trackOffset = dataOffset + length; // Attempt to skip to end of event
                     if (!_midiFile) return; // readBytes might have stopped
                }
            } else {
                 _log(MidiLogLevel::WARN, "Invalid Tempo meta event length %u (expected 3) on track %u. Skipping.", length, trackIndex);
                 trackOffset += length; // Skip data
            }
            break;

        case META_TIME_SIGNATURE: // 0x58
            if (length == 4) {
                uint8_t buffer[4];
                 if (_readBytes(trackOffset, buffer, 4) == 4) {
                    trackOffset += 4;
                     uint8_t numerator = buffer[0];
                     uint8_t denominator_pow2 = buffer[1]; // Denominator is 2^denominator_pow
                     uint8_t clocks_per_metronome = buffer[2]; // MIDI clocks per metronome click
                     uint8_t num_32nd_notes_per_beat = buffer[3]; // Number of 32nd notes per MIDI quarter note (usually 8)

                     // Basic validation
                     if (numerator == 0) {
                         _log(MidiLogLevel::WARN, "Track %u Time Signature has zero numerator. Using 4/4.", trackIndex);
                         numerator = 4;
                         denominator_pow2 = 2; // 2^2 = 4
                     }

                     uint16_t denominator = (1 << denominator_pow2);
                      _log(MidiLogLevel::DEBUG, "Time Signature: %u/%u, Clocks/Met: %u, 32nds/QN: %u", numerator, denominator, clocks_per_metronome, num_32nd_notes_per_beat);

                     if (_timeSignatureCallback) {
                         // Pass the raw denominator power value as some synths might use it directly
                         _timeSignatureCallback(numerator, denominator_pow2, clocks_per_metronome, num_32nd_notes_per_beat);
                     }
                 } else {
                    _log(MidiLogLevel::ERROR, "Error reading Time Signature data for track %u", trackIndex);
                     trackOffset = dataOffset + length; // Attempt to skip
                      if (!_midiFile) return;
                 }
            } else {
                _log(MidiLogLevel::WARN, "Invalid Time Signature meta event length %u (expected 4) on track %u. Skipping.", length, trackIndex);
                trackOffset += length; // Skip data
            }
            break;

        // Add cases for other common meta events if needed (Text, Copyright, Track Name, etc.)
         case META_TRACK_NAME: // 0x03 Sequence/Track Name
            {
                char nameBuffer[length + 1]; // +1 for null terminator
                if (length > 0) {
                    if (_readBytes(trackOffset, (uint8_t*)nameBuffer, length) == length) {
                        nameBuffer[length] = '\0'; // Null terminate
                        _log(MidiLogLevel::INFO, "Track %u Name: \"%s\"", trackIndex, nameBuffer);
                        // Optional: Add a callback for track name if needed
                        // if (_trackNameCallback) _trackNameCallback(trackIndex, nameBuffer);
                    } else {
                        _log(MidiLogLevel::WARN, "Could not read Track Name data for track %u", trackIndex);
                         if (!_midiFile) return;
                    }
                } else {
                     _log(MidiLogLevel::DEBUG, "Track %u has empty Track Name event.", trackIndex);
                }
                trackOffset += length; // Advance offset past data (or by 0 if length was 0)
            }
            break;
        // Example: Add case 0x01 (Text), 0x02 (Copyright), etc. similarly if desired

        default:
            // Unknown or unhandled meta event, just skip over its data
             _log(MidiLogLevel::DEBUG, "Skipping unhandled Meta Event Type 0x%02X, Length %u on track %u", metaType, length, trackIndex);
            trackOffset += length;
            // Sanity check seek position
             if (trackOffset > _midiFile.size()) {
                  _log(MidiLogLevel::ERROR, "Error skipping meta event 0x%02X: Offset %u exceeds file size %u.", metaType, trackOffset, _midiFile.size());
                  stop();
                  return;
             }
             if (_midiFile && !_midiFile.seek(trackOffset)) { // Ensure file pointer is updated
                  _log(MidiLogLevel::ERROR, "Failed to seek past meta event 0x%02X data.", metaType);
                  stop();
                  return;
             }
            break;
    }

     // Ensure offset is correct even if handler didn't read all bytes (e.g., due to error)
     // This is slightly risky if the handler logic is wrong, but helps prevent getting stuck.
     if (trackOffset < dataOffset + length) {
          _log(MidiLogLevel::WARN,"Meta event handler for type 0x%02X did not consume all %u bytes. Forcing skip.", metaType, length);
          trackOffset = dataOffset + length;
     }
}

void ESP32MidiPlayer::_handleSysexEvent(uint8_t trackIndex, uint8_t type, uint32_t& trackOffset) {
    // SysEx events (F0) and "escape" sequences (F7) have a VLQ length field
    uint32_t length = _readVariableLengthQuantity(trackOffset);
     if (!_midiFile) return;

