serifpersia/ESP32MidiPlayer/src/ESP32MidiPlayer.cpp
     _log(MidiLogLevel::DEBUG, "SysEx event (Type 0x%02X), Length %u on track %u - Skipping data.", type, length, trackIndex);

    // Optional: Read data and provide via callback if needed
    // uint8_t* sysExData = new uint8_t[length];
    // if (sysExData && _readBytes(trackOffset, sysExData, length) == length) {
    //    // Add a SysEx callback if you need to handle this data
    //    // if (_sysExCallback) _sysExCallback(type, sysExData, length);
    //    delete[] sysExData;
    // } else {
    //    _log(MidiLogLevel::ERROR, "Error reading SysEx data or allocating memory for track %u", trackIndex);
    //    delete[] sysExData; // Safe to delete nullptr
    //    // Consider stopping playback if SysEx data is critical and read failed
    //    trackOffset = // try to determine end of event based on initial offset + VLQ length + data length? Difficult.
    //    stop(); // Safer to stop if read fails mid-event
    //    return;
    // }

    trackOffset += length; // Skip SysEx data

     // Sanity check seek position
     if (trackOffset > _midiFile.size()) {
          _log(MidiLogLevel::ERROR, "Error skipping SysEx event 0x%02X: Offset %u exceeds file size %u.", type, trackOffset, _midiFile.size());
          stop();
          return;
     }
     if (_midiFile && !_midiFile.seek(trackOffset)) { // Ensure file pointer is updated
          _log(MidiLogLevel::ERROR, "Failed to seek past SysEx event 0x%02X data.", type);
          stop();
          return;
     }
     // SysEx cancels running status
     _tracks[trackIndex].lastStatusByte = 0;
}


// Internal logging helper (modified for levels)
void ESP32MidiPlayer::_log(MidiLogLevel level, const char* format, ...) {
    // 1. Check if a callback is registered
    // 2. Check if the message's level is severe enough to be logged
    if (_logCallback && level <= _currentLogLevel && _currentLogLevel != MidiLogLevel::NONE) {
        // Increased buffer size slightly for potential long filenames or debug messages
        char buffer[256];
        va_list args;
        va_start(args, format);
        vsnprintf(buffer, sizeof(buffer), format, args);
        va_end(args);

        // Ensure null termination even if message was truncated
        buffer[sizeof(buffer) - 1] = '\0';

        // Call the user's callback, passing the level and the formatted message
        _logCallback(level, buffer);
    }
}